---
kind: type
id: T:Autodesk.Revit.DB.MEPSupportUtils
source: html/07955d2c-cce3-0a0f-4888-bfba19ad2043.htm
---
# Autodesk.Revit.DB.MEPSupportUtils

General utility methods for the Autodesk Revit MEP Supporting components.

## Syntax (C#)
```csharp
public static class MEPSupportUtils
```